DanTsai2014/STM32_Joystick/Smart_EPW_lib/EPW_behavior.c
#include "FreeRTOS.h"
#include "timers.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_syscfg.h"
#include "EPW_behavior.h"
#include "ultrasound.h"
#include "timers.h"
#include "uart.h"
#include "clib.h"
#include "EPW_command.h"
#include "PID.h"
#include "linear_actuator.h"

#define B_phase 1
#define NEURAL_IDENTIFIER 1
#define PID_ADJUST 1
#define RECORD_SIZE 750

int speed_left_counter_1;
int speed_right_counter_1;
int differential_counter = 0;
int first_control = 0;
int base_pwm_l = 120;
int base_pwm_r = 120;
int data_sending = 0;
int first_train = 0;
int last_state = 0;
float end_tune_condition = 5;
int err_ratio = 10;

int path_record_r_p[RECORD_SIZE];  // path record for plant
int path_record_l_p[RECORD_SIZE];  // path record for plant
int path_record_r_n[RECORD_SIZE];  // path record for neural identifier
int path_record_l_n[RECORD_SIZE];  // path record for neural identifier
int kp_record_l[RECORD_SIZE];
int kp_record_r[RECORD_SIZE];
int ki_record_l[RECORD_SIZE];
int ki_record_r[RECORD_SIZE];
int kd_record_r[RECORD_SIZE];
int kd_record_l[RECORD_SIZE];
int desire_record[RECORD_SIZE];
int c_out_l[RECORD_SIZE];
int c_out_r[RECORD_SIZE];
int path_counter = 0;    // path_record_p[path_counter]

float move_speed = 10.0;

neural_state_t n_r;
neural_state_t n_l;
neural_state_t n_r_back;
neural_state_t n_l_back;
int err_sum = 0;

// input command
float rin = 0.0f;

float referenceModel(float rin, float rf_out_1);
float referenceModel2(float rin, float rf_out_1, float rf_out_2);
float abs2(float number);

void array_1d_Init(int size, float value, float *array){
	int i;
	float tmp = value / (float)size;
    for (i = 0; i < size; ++i){ 
    	array[i] = -value + tmp * (i * 2);
    }
}

void array_1d_Init_2(int size, float value, float *array){
	int i;
    for (i = 0; i < size; ++i) array[i] = value;
}

// array[x][y]  array[i][j]
void array_2d_Init(int size_x, int size_y, float value, float array[][size_y]){
    int i,j;
    for ( i = 0; i < size_x; ++i){
    	float tmp = value / (float)size_x;
        for ( j = 0; j < size_y; ++j){
            array[i][j] = tmp*i;
        }
    }
}

// array2 = array1
void array_1d_Copy(int size, float *array1, float *array2){
    int i;
    for ( i = 0; i < size; ++i)
        array2[i] = array1[i];
}

// array2 = array1
void array_2d_Copy(int size_x, int size_y, float array1[][size_y], float array2[][size_y]){
    int i, j;
    for ( i = 0; i < size_x; ++i)
        for ( j = 0; j < size_y; ++j)
            array2[i][j] = array1[i][j];
}

float referenceModel(float rin, float rf_out_1){
	return ((9 * rin + 1000 * rf_out_1) / 1009);
}

float referenceModel2(float rin, float rf_out_1, float rf_out_2){
    return ((25 * rin - rf_out_2 - 7 * rf_out_1)/25);
}

typedef enum{
		CAR_STATE_IDLE,
		CAR_STATE_MOVE_FORWARD,
		CAR_STATE_MOVE_BACK,
		CAR_STATE_MOVE_LEFT,
		CAR_STATE_MOVE_RIGHT,
		CAR_STATE_STOPPING
}car_state_t;

static car_state_t car_state;

int speed_right_counter;
int speed_left_counter;

int distance_left_counter = 0;
int distance_right_counter = 0;

/*pwm regulate of two motor */
static int pwm_value_left = 120; /*default pwm value*/
static int pwm_value_right = 120;
static int motor_speed_value = 1; /*global speed value, range is 0~10.
static char flag;

/*pid alg premeter.*/
static float Kp,Ki,Kd;

/*Timer handle declare*/
xTimerHandle carTimers;
xTimerHandle PID_Timers;
xTimerHandle Show_data_Timers;
xTimerHandle Get_Motor_Timers;

/*============================================================================*/
/*============================================================================*
 ** function : init_motor
 ** brief :  initialize the motor control pin set, the AF is  setting by pwm mode based on timer.
 ** param :  None
 ** retval : None
 **============================================================================*/
/*============================================================================*/
void init_motor(void){
		GPIO_InitTypeDef GPIO_InitStruct;
		/* Enable GPIO A clock. */
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
		// Setup Blue & Green LED on STM32-Discovery Board to use PWM.
		GPIO_InitStruct.GPIO_Pin =  MOTOR_LEFT_PWM_PIN|MOTOR_RIGHT_PWM_PIN;
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
		GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
		GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
		GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
		GPIO_Init( MOTOR_PWM_PORT, &GPIO_InitStruct );   

		/*====================TIM Setting=============================*/
		GPIO_PinAFConfig(MOTOR_PWM_PORT, GPIO_PinSource13, GPIO_AF_TIM4);
		GPIO_PinAFConfig(MOTOR_PWM_PORT, GPIO_PinSource15, GPIO_AF_TIM4);

		/* TIM4 clock enable */
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

		/**
		 * Compute the prescaler value
		 * old version , 84MHz / 2000 / 42  = 1KHz
		 * --> u32 PrescalerValue = 42 - 1; 
		 * --> u32 TimPeriod = 2000 - 1;
		 *
		 * new version is setting for pwm 8 bit resolution , 84MHz / 256 / 250  ~= 1312.5 Hz
		 */   
		u32 PrescalerValue = 250 - 1; /*YinChen added*/
		u32 TimPeriod = 256 - 1;

		/* Time base configuration */
		TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
		TIM_TimeBaseStructure.TIM_Period = TimPeriod;     
		TIM_TimeBaseStructure.TIM_Prescaler =PrescalerValue ; 
		TIM_TimeBaseStructure.TIM_ClockDivision = 0 ;
		TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
		TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

		/*====================PWM Setting=============================*/
		TIM_OCInitTypeDef TIM_OCInitStructure;
		TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
		TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
		TIM_OCInitStructure.TIM_Pulse = 0; /*max pwm value is TIM's period, in our case, it's  255*/
		TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
		/* PWM1 Mode configuration: Channel2   (MOTOR_LEFT_PWM_PIN)*/
		TIM_OC2Init(TIM4, &TIM_OCInitStructure);
		TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
		/* PWM1 Mode configuration: Channel4   (MOTOR_RIGHT_PWM_PIN)*/
		TIM_OC4Init(TIM4, &TIM_OCInitStructure);
		TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);

		TIM_Cmd(TIM4, ENABLE);
}


void init_motor_CWCCW(void){
		GPIO_InitTypeDef GPIO_InitStruct;
		/* Enable GPIO D clock. */
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
        #ifdef L298N_MODE
        GPIO_InitStruct.GPIO_Pin =  MOTOR_LEFT_IN1_PIN| MOTOR_LEFT_IN2_PIN | MOTOR_RIGHT_IN3_PIN | MOTOR_RIGHT_IN4_PIN ;
        #else /*Smart EPW*/
        GPIO_InitStruct.GPIO_Pin =  MOTOR_LEFT_CWCCW_PIN | MOTOR_RIGHT_CWCCW_PIN;
        #endif
	
