DanTsai2014/STM32_Joystick/Smart_EPW_lib/EPW_behavior.c
		array_1d_Init_2(RECORD_SIZE, 0, path_record_r_p);
		array_1d_Init_2(RECORD_SIZE, 0, path_record_l_p);
		array_1d_Init_2(RECORD_SIZE, 0, path_record_r_n);
		array_1d_Init_2(RECORD_SIZE, 0, path_record_l_n);
		array_1d_Init_2(RECORD_SIZE, 0, kp_record_l);
		array_1d_Init_2(RECORD_SIZE, 0, kp_record_r);
		array_1d_Init_2(RECORD_SIZE, 0, ki_record_l);
		array_1d_Init_2(RECORD_SIZE, 0, ki_record_r);
		array_1d_Init_2(RECORD_SIZE, 0, kd_record_l);
		array_1d_Init_2(RECORD_SIZE, 0, kd_record_r);
		array_1d_Init_2(RECORD_SIZE, 0, desire_record);
		array_1d_Init_2(RECORD_SIZE, 0, c_out_r);
		array_1d_Init_2(RECORD_SIZE, 0, c_out_l);
		path_counter = 0;

		carTimers = xTimerCreate("Car_State_Polling",	 ( CAR_POLLING_PERIOD), pdTRUE, ( void * ) 1,  Car_State_Polling );
		xTimerStart( carTimers, 0 );

}



/*============================================================================*
 ** Prototype    : Car_State_Polling
 ** Description  : record the car's state of all behavior and keep to polling,
                   this is used for auto-avoidance polling mechanism
 ** Input        : None
 ** Output       : None
 ** Return Value : 
 *============================================================================*/
#define THRESHOLD_DISTANCE 50 /*unit : cm*/
/**
 *  the unit is  (CAR_POLLING_PERIOD ms) , so depend on the CAR_POLLING_PERIOD.
 *  for example the CAR_POLLING_PERIOD=20, CAR_MOVING_PERIOD=10,
 *  then the car moving will be keep 200(10*20) ms time.
 */
#define CAR_MOVING_PERIOD 250 
#define CAR_REST_PERIOD  2
void Car_State_Polling(){
        unsigned int distance[4];
        
		if(car_state==CAR_STATE_IDLE){

		}
		else if(car_state==CAR_STATE_MOVE_FORWARD){               
            if (distance_right_counter >= MOVE_PERIOD || distance_left_counter > MOVE_PERIOD)  //2000 == 4 cycle
            {
				car_state = CAR_STATE_STOPPING;
				last_state = CAR_STATE_MOVE_FORWARD;
            }
		}	
		else if(car_state==CAR_STATE_MOVE_BACK){   
			if (distance_right_counter >= MOVE_BACK_PERIOD || distance_left_counter >= MOVE_BACK_PERIOD)  //2000 == 4 cycle
            {
				car_state = CAR_STATE_STOPPING;
        		last_state = CAR_STATE_MOVE_BACK;
            }
		}
        else if(car_state==CAR_STATE_MOVE_LEFT){
            if (distance_right_counter >= MOVE_LEFT_RIGHT_PERIOD && distance_left_counter >= MOVE_LEFT_RIGHT_PERIOD)  //2000 == 4 cycle
            {
				car_state = CAR_STATE_IDLE;
	    		last_state = CAR_STATE_MOVE_LEFT;
            }
		}   
        else if(car_state==CAR_STATE_MOVE_RIGHT){
            if(distance_right_counter >= MOVE_LEFT_RIGHT_PERIOD &&  distance_left_counter >= MOVE_LEFT_RIGHT_PERIOD)
            {
				car_state = CAR_STATE_IDLE;
    			last_state = CAR_STATE_MOVE_RIGHT;
		    }
		}
}

void controller_initialize(neural_state_t *n_s){
	n_s->u_1 = n_s->u_1_base;
	n_s->u_2 = n_s->u_2_base;
	n_s->u = n_s->u_base;	
}

void neural_checkstop(neural_state_t *n_s){
	err_ratio = (int) n_s->total_err;
	if (err_ratio < 500 && err_ratio > -500)
	{
		// stop adjustment after the error summation is less than the threshold value
		n_s->stop_tune = 1;
	}else if(err_ratio > 1000 && err_ratio < -1000){
		// restart adjustment
		n_s->stop_tune = 0;
		init_Neural(&n_s, 0.01, 0.01, 0);
	}
	else{
	}	
}

void distance_initialize(){
	distance_left_counter = 0;
	distance_right_counter = 0;
}

void speeed_initialize(){
	speed_left_counter = 0;
	speed_right_counter = 0;
}

/*============================================================================*/
/*============================================================================*
 ** function : parse_EPW_motor_dir
 ** brief : parse the EPW of motor direction from the uart siganl,
            note, the motor_pwm_value  max is 255, even if 256, it's duty cycle is equal to 255.
 ** param : DIR_cmd
 ** retval :  None
 **============================================================================*/
/*============================================================================*/
void parse_EPW_motor_dir(unsigned char DIR_cmd)
{
		if(DIR_cmd == 'f'){
			if (data_sending != 1 && car_state == CAR_STATE_IDLE) // Do not control the wheelchair when sending data with usart!
			{
				controller_initialize(&n_r);
				controller_initialize(&n_l);

				if (last_state == CAR_STATE_MOVE_FORWARD)
				{
					neural_checkstop(&n_r);
					neural_checkstop(&n_l);
				}
				if (last_state == CAR_STATE_MOVE_BACK)
				{
					neural_checkstop(&n_r_back);
					neural_checkstop(&n_l_back);
				}
				car_state = CAR_STATE_MOVE_FORWARD;
			}
		}
		else if(data_sending != 1 && DIR_cmd == 's'){
				car_state = CAR_STATE_STOPPING;
		}
		else if(data_sending != 1 && DIR_cmd == 'b'){
			if(car_state == CAR_STATE_IDLE){
				controller_initialize(&n_r_back);
				controller_initialize(&n_l_back);

				if (last_state == CAR_STATE_MOVE_FORWARD)
				{
					neural_checkstop(&n_r);
					neural_checkstop(&n_l);
				}
				if (last_state == CAR_STATE_MOVE_BACK)
				{
					neural_checkstop(&n_r_back);
					neural_checkstop(&n_l_back);
				}
				car_state = CAR_STATE_MOVE_BACK;
            }
		}
        else if(data_sending != 1 && DIR_cmd == 'l'){
        	if(car_state == CAR_STATE_IDLE){
				controller_initialize(&n_r);
				controller_initialize(&n_l_back);

				if (last_state == CAR_STATE_MOVE_FORWARD)
				{
					neural_checkstop(&n_r);
					neural_checkstop(&n_l);
				}
				if (last_state == CAR_STATE_MOVE_BACK)
				{
					neural_checkstop(&n_r_back);
					neural_checkstop(&n_l_back);
				}

                car_state = CAR_STATE_MOVE_LEFT;
            }
		}
        else if(data_sending != 1 && DIR_cmd == 'r'){
        	if(car_state == CAR_STATE_IDLE){
				controller_initialize(&n_r_back);
				controller_initialize(&n_l);

				if (last_state == CAR_STATE_MOVE_FORWARD)
				{
					neural_checkstop(&n_r);
					neural_checkstop(&n_l);
				}
				if (last_state == CAR_STATE_MOVE_BACK)
				{
					neural_checkstop(&n_r_back);
					neural_checkstop(&n_l_back);
				}

