DanTsai2014/STM32_Joystick/Smart_EPW_lib/EPW_behavior.c
	    }
        // 11. Calculate the output of PID controller
        n_s->du = n_s->kp * n_s->xc[0] + n_s->ki * n_s->xc[1] + n_s->kd * n_s->xc[2];
        n_s->u = n_s->u_1 + n_s->du;
        if (n_s->u < 0)
        {
        	n_s->u = 0;
        }else if(n_s->u > 110) {
        	n_s->u = 110;
        }
        // 12. update yout(k-1) u(k-1)
        n_s->yout_1 = n_s->x[1];
        n_s->u_2 = n_s->u_1;
        n_s->u_1 = n_s->u;

        // 13. update e(k-1) e(k-2)
        n_s->e_2 = n_s->e_1;
        n_s->e_1 = n_s->e;

        // 14. update input of RBFNN
        n_s->x[0] = n_s->du;
        n_s->x[1] = (float)encoder_counter;
        n_s->x[2] = n_s->yout_1;

    }
}

void pid_update(neural_state_t *n_s, float rin, int encoder_counter, int command_distance_count){

	n_s->rf_out = referenceModel(rin, n_s->rf_out_1);
   	n_s->e = n_s->rf_out - (float)encoder_counter;
    n_s->rf_out_2 = n_s->rf_out_1;
	n_s->rf_out_1 = n_s->rf_out;
    n_s->desire = n_s->desire +(int)n_s->rf_out;

    // Incremental PID
    n_s->xc[0] = n_s->e - n_s->e_1;
    n_s->xc[1] = n_s->e;
    n_s->xc[2] = n_s->e - (2 * n_s->e_1) + n_s->e_2; 

    // Calculate the output of PID controller
    n_s->du = n_s->kp * n_s->xc[0] + n_s->ki * n_s->xc[1] + n_s->kd * n_s->xc[2];
    n_s->u = n_s->u_1 + n_s->du;
    if (n_s->u < 0)
    {
    	n_s->u = 0;
    }else if(n_s->u > 110) {
    	n_s->u = 110;
    }

    // update yout(k-1) u(k-1)
    n_s->yout_1 = n_s->x[1];
    n_s->u_2 = n_s->u_1;
    n_s->u_1 = n_s->u;

    // update e(k-1) e(k-2)
    n_s->e_2 = n_s->e_1;
    n_s->e_1 = n_s->e;

}

void send_data_task(void *p){
	while(1){
		//if (alarm_message == 'A')
		//{
		//printf("r : %d", message_counter2);
		//printf("%c", alarm_message);
		//USART_puts(USART6, )
		//	alarm_message = 'F';
		//}
		//USART_puts(USART6, received_string);
		if (data_sending == 1)
		{
		    int tmp_counter = 0;
    		for (tmp_counter = path_counter - 2; tmp_counter < path_counter; ++tmp_counter)
    		{
    			printf("%d %d %d %d %d %d %d %d %d %d %d %d %d %d %d\n", desire_record[tmp_counter], path_record_l_p[tmp_counter], path_record_l_p[tmp_counter]-path_record_l_p[tmp_counter-1], path_record_r_p[tmp_counter], path_record_r_p[tmp_counter]-path_record_r_p[tmp_counter-1],path_record_l_n[tmp_counter], path_record_r_n[tmp_counter], kp_record_l[tmp_counter], kp_record_r[tmp_counter], ki_record_l[tmp_counter], ki_record_r[tmp_counter], kd_record_l[tmp_counter], kd_record_r[tmp_counter], c_out_l[tmp_counter], c_out_r[tmp_counter]);
    		}
    		printf("total e r r & total e r r 1 R : %d %d\n", (int)n_r.total_err, (int)n_r.total_err_1);
    		printf("total e r r & total e r r 1 L : %d %d\n", (int)n_l.total_err, (int)n_l.total_err_1);
    		if (n_r.stop_tune == 1)
    		{
    			printf("stop r\n");
    		}
    		if (n_l.stop_tune == 1)
    		{
    			printf("stop l\n");
    		}
    		printf("e r r _ r a t i o * 1 0 0 = %d\n", (int)err_ratio);
    		array_1d_Init_2(RECORD_SIZE, 0, path_record_r_p);
    		array_1d_Init_2(RECORD_SIZE, 0, path_record_l_p);
    		array_1d_Init_2(RECORD_SIZE, 0, path_record_r_n);
    		array_1d_Init_2(RECORD_SIZE, 0, path_record_l_n);
    		array_1d_Init_2(RECORD_SIZE, 0, kp_record_l);
			array_1d_Init_2(RECORD_SIZE, 0, kp_record_r);
			array_1d_Init_2(RECORD_SIZE, 0, ki_record_l);
			array_1d_Init_2(RECORD_SIZE, 0, ki_record_r);
			array_1d_Init_2(RECORD_SIZE, 0, kd_record_l);
			array_1d_Init_2(RECORD_SIZE, 0, kd_record_r);
			array_1d_Init_2(RECORD_SIZE, 0, desire_record);
			array_1d_Init_2(RECORD_SIZE, 0, c_out_l);
			array_1d_Init_2(RECORD_SIZE, 0, c_out_r);
			if (last_state == CAR_STATE_MOVE_FORWARD)
			{
				n_r.total_err_1 = n_r.total_err;
	    		n_r.total_err = 0;
	    		n_r.desire = 0;

	    		n_l.total_err_1 = n_l.total_err;
	    		n_l.total_err = 0;
	    		n_l.desire = 0;
			}

			if(last_state == CAR_STATE_MOVE_BACK){
	    		n_r_back.total_err_1 = n_r_back.total_err;
	    		n_r_back.total_err = 0;
	    		n_r_back.desire = 0;

	    		n_l_back.total_err_1 = n_l_back.total_err;
	    		n_l_back.total_err = 0;
	    		n_l_back.desire = 0;

			}
			path_counter = 0;
			data_sending = 0;
		}
		vTaskDelay(20);
	}
}

void data_record(){
	if (path_counter < RECORD_SIZE)
	{
	    path_record_r_p[path_counter] = distance_right_counter; 
    	path_record_l_p[path_counter] = distance_left_counter;
    	path_record_r_n[path_counter] = (int)n_r.ynout_sum;
    	path_record_l_n[path_counter] = (int)n_l.ynout_sum;
		kp_record_l[path_counter] = (int)(n_l.kp * 10000);
		kp_record_r[path_counter] = (int)(n_r.kp * 10000);
		ki_record_l[path_counter] = (int)(n_l.ki * 10000);
		ki_record_r[path_counter] = (int)(n_r.ki * 10000);
		kd_record_r[path_counter] = (int)(n_l.kd * 100);
		kd_record_l[path_counter] = (int)(n_r.kd * 100);
		desire_record[path_counter] = n_r.desire;
		c_out_l[path_counter] = (int)n_l.u_1;
		c_out_r[path_counter] = (int)n_r.u_1;
    	path_counter++;
	}
}

void record_controller_base(neural_state_t *n_s){
	n_s->u_1_base = n_s->u_1;
	n_s->u_2_base = n_s->u_2;
	n_s->u_base = n_s->u;
}

void neural_task(void *p)
{
	while(1){
		detachInterrupt(EXTI_Line0); /*close external interrupt 0*/ 
		detachInterrupt(EXTI_Line1); /*close external interrupt 1*/ 
		detachInterrupt(EXTI_Line2); /*close external interrupt 2*/ 
		detachInterrupt(EXTI_Line3); /*close external interrupt 3*/ 

	    if(car_state == CAR_STATE_MOVE_FORWARD){
	    	getMotorData();
    		rin = move_speed;

	    	neural_update(&n_r, rin, speed_right_counter_1, distance_right_counter);
	    	neural_update(&n_l, rin, speed_left_counter_1, distance_left_counter);

	    	data_record();

		    float input_l =  n_l.u;
		    float input_r =  n_r.u;

	        proc_cmd("forward", base_pwm_l+(int)input_l, base_pwm_r+(int)input_r);

	    }
	    else if (car_state == CAR_STATE_MOVE_BACK)
	    {
	    	getMotorData();
	    	float err = 0;
    		rin = 10;

		    neural_update(&n_r_back, rin, speed_right_counter_1, distance_right_counter);
		    neural_update(&n_l_back, rin, speed_left_counter_1, distance_left_counter);

		    float input_l =  n_l_back.u_1;
		    float input_r =  n_r_back.u_1;

	        proc_cmd("forward", base_pwm_l - input_l, base_pwm_r - input_r);
	    }
	    else if (car_state == CAR_STATE_MOVE_LEFT){
	    	rin = 5;
	    	getMotorData();

	    	if (distance_right_counter > MOVE_LEFT_RIGHT_PERIOD)
	    	{
	    		rin = 0;
	    		pid_update(&n_r, rin, speed_right_counter_1, distance_right_counter);
	    	}else{
	    		pid_update(&n_r, rin, speed_right_counter_1, distance_right_counter);
	    	}

